           TESTSUITE 'GREETING AND FAREWELL (FAREWELL WILL FAIL)'               
                                                                                
           TESTCASE 'IT RETURNS HELLO                                           
           MOVE 'GREETING' TO WS-MESSAGE-TYPE                                   
           PERFORM 2000-SPEAK                                                   
           EXPECT WS-MESSAGE TO BE 'HELLO                                       
                                                                                
           TESTCASE 'IT RETURNS GOODBYE                                         
           MOVE 'FAREWELL' TO WS-MESSAGE-TYPE                                   
           PERFORM 2000-SPEAK                                                   
           EXPECT WS-MESSAGE TO BE 'GOODBYE                                     
