           TestSuite "Tests of alphanumeric expectations"

           TestCase "Equality with an alphanumeric literal using TO BE"
           move "value1" to ws-field-1
           Expect ws-field-1 to be "value1"

           TestCase "Equality with an alphanumeric literal using TO EQUAL"
           move "value2" to ws-field-1
           Expect ws-field-1 to equal "value2"

           TestCase "Equality with an alphanumeric literal using '='"
           move "value3" to ws-field-1
           Expect ws-field-1 = "value3"

           TestCase "Equality with an alphanumeric literal and reference modification"
           move "Hello, World!" to ws-field-2
           Expect ws-field-2(8:5) to be "World"

           TestCase "Non-equality with an alphanumeric literal using TO BE"
           move "value4" to ws-field-1
           Expect ws-field-1 not to be "value1"

           TestCase "Non-equality with an alphanumeric literal using TO EQUAL"
           move "value5" to ws-field-1
           Expect ws-field-1 not to equal "value1"

           TestCase "Non-equality with an alphanumeric literal using '!='"
           move "value6" to ws-field-1
           Expect ws-field-1 != "value1"

           TestCase "Non-equality with an alphanumeric literal and reference modification"
           move "Hello, World!" to ws-field-2
           Expect ws-field-2(8:6) not to be "World"




