      * Start of COPY001
       01  TEST-DATA-LAYOUT-001-A.
           05  TEST-DATA-ELEMENT-001-A1 PIC X(05).
           05  TEST-DATA-ELEMENT-001-A2 PIC ZZ9.
       01  TEST-DATA-LAYOUT-001-B.
           05  TEST-DATA-ELEMENT-001-B1 PIC X(18).
           05  TEST-DATA-ELEMENT-001-B2 PIC S9(05) COMP-3.
      * End of COPY001
