      * Start of COPY006
           03  COPY006-GROUP-1.
               05  COPY006-ITEM-1 PIC X.
               COPY COPY003.
               05  COPY006-ITEM-2 PIC X.
           03  COPY006-GROUP-2.
               COPY COPY004.
      * End of COPY006