      * Start of COPY002                                                        
       01  TEST-GROUP-002.                                                      
           COPY COPY003.                                                        
           COPY COPY004.                                                        
           05 TEST-SOME-OTHER-STUFF PIC X.                                      
      * End of COPY002                                                          
