01  ALPHA.                                                                      
  02  BETA    PIC S99.                                                          
  02  CHARLIE    PIC S9(5)V99.                                                  
  02  DELTA    PIC S9999 OCCURS 1 TO 52 TIMES                                   
      DEPENDING ON BETA OF ALPHA.                                               
