      * Start of mixed005.CBL
       01  mixed-005-group-item.
      * Start of mixed006
           03  Mixed006-Group-1.
               05  Mixed006-Item-1 pic X.
      * Start of mixed003
           05  Mixed003-Item-1 pic X.
           05  Mixed003-Item-2 pic X.
      * End of mixed003
      *        copy mixed003.
               05  Mixed006-Item-2 PIC X.
           03  mixed006-Group-2.
      * Start of Mixed004
           05  Mixed004-Item-1 pic X.
           05  Mixed004-Item-2 pic X.
      * End of mixed004
      *        copy mixed004.
      * End of mixed006
      *    copy mixed006.
      * End of mixed005.CBL