      **********************************************************************
      * AUTHOR:    DAVE NICOLETTE
      * DATE:      30 JUN 2015
      * PURPOSE:   DEMONSTRATE FILE MOCKING FEATURES OF ZUTZCPC.
      **********************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILEDEMO.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

       SELECT INPUT-FILE ASSIGN TO INPUT-FILENAME
           ORGANIZATION IS LINE SEQUENTIAL
           FILE STATUS IS WS-INPUT-FILE-STATUS.

       SELECT OUTPUT-FILE ASSIGN TO OUTPUT-FILENAME
           ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.

       FD INPUT-FILE.
       01 INPUT-RECORD PIC X(200).

       FD OUTPUT-FILE.
       01 OUTPUT-RECORD PIC X(200).

       WORKING-STORAGE SECTION.
            COPY ZUTZCWS     .

       01  WS-FILE-STATUS.
           05  WS-INPUT-FILE-STATUS   PIC X(02).
           05  WS-OUTPUT-FILE-STATUS  PIC X(02).
           05  WS-OTHER-FILE-STATUS   PIC X(02).

       01  WS-RECORD-AREAS.
           05  WS-INPUT-RECORD        PIC X(200).
           05  WS-OUTPUT-RECORD       PIC X(200).

       PROCEDURE DIVISION.
           PERFORM UT-INITIALIZE

           DISPLAY SPACE
           DISPLAY "TEST SUITE:"
           DISPLAY
           'DEMONSTRATE FILE MOCKS'
           DISPLAY SPACE


           MOVE 'IT MOCKS SUCCESSFUL FILE OPEN INPUT'
               TO UT-TEST-CASE-NAME
           PERFORM UT-BEFORE
           SET UT-FIND-FILE-MOCK TO TRUE
           MOVE 'INPUT-FILE' TO UT-MOCK-FIND-FILENAME
           MOVE 'OPEN' TO UT-MOCK-FIND-OPERATION
           MOVE  ZERO  TO UT-MOCK-ACCESS-COUNT(UT-MOCK-IX)
           MOVE 00 TO UT-MOCK-SET-FILE-STATUS
           SET UT-FIND-FILE-MOCK TO TRUE
           PERFORM UT-SET-MOCK
           PERFORM 0100-OPEN-INPUT
           ADD 1 TO UT-TEST-CASE-COUNT
           SET UT-NORMAL-COMPARE TO TRUE
           MOVE WS-INPUT-FILE-STATUS TO UT-ACTUAL
           MOVE '00'
                       TO UT-EXPECTED
           SET UT-COMPARE-DEFAULT TO TRUE
           PERFORM UT-ASSERT-EQUAL

           PERFORM UT-AFTER
           MOVE 'IT MOCKS READING AFTER EOF'
               TO UT-TEST-CASE-NAME
           PERFORM UT-BEFORE
           SET UT-FIND-FILE-MOCK TO TRUE
           MOVE 'INPUT-FILE' TO UT-MOCK-FIND-FILENAME
           MOVE 'READ' TO UT-MOCK-FIND-OPERATION
           MOVE  ZERO  TO UT-MOCK-ACCESS-COUNT(UT-MOCK-IX)
           MOVE 47 TO UT-MOCK-SET-FILE-STATUS
           SET UT-FIND-FILE-MOCK TO TRUE
           PERFORM UT-SET-MOCK
           PERFORM 0200-READ-INPUT-FILE
           ADD 1 TO UT-TEST-CASE-COUNT
           SET UT-NORMAL-COMPARE TO TRUE
           MOVE WS-INPUT-FILE-STATUS TO UT-ACTUAL
           MOVE '47'
                       TO UT-EXPECTED
           SET UT-COMPARE-DEFAULT TO TRUE
           PERFORM UT-ASSERT-EQUAL

           PERFORM UT-AFTER
           MOVE 'IT MOCKS FILE-NOT-FOUND ON OPEN INPUT'
               TO UT-TEST-CASE-NAME
           PERFORM UT-BEFORE
           SET UT-FIND-FILE-MOCK TO TRUE
           MOVE 'INPUT-FILE' TO UT-MOCK-FIND-FILENAME
           MOVE 'OPEN' TO UT-MOCK-FIND-OPERATION
           MOVE  ZERO  TO UT-MOCK-ACCESS-COUNT(UT-MOCK-IX)
           MOVE 35 TO UT-MOCK-SET-FILE-STATUS
           SET UT-FIND-FILE-MOCK TO TRUE
           PERFORM UT-SET-MOCK
           PERFORM 0100-OPEN-INPUT
           ADD 1 TO UT-TEST-CASE-COUNT
           SET UT-NORMAL-COMPARE TO TRUE
           MOVE WS-INPUT-FILE-STATUS TO UT-ACTUAL
           MOVE '35'
                       TO UT-EXPECTED
           SET UT-COMPARE-DEFAULT TO TRUE
           PERFORM UT-ASSERT-EQUAL

           PERFORM UT-AFTER
           MOVE 'IT MOCKS ERROR ON FILE OPEN INPUT'
               TO UT-TEST-CASE-NAME
           PERFORM UT-BEFORE
           SET UT-FIND-FILE-MOCK TO TRUE
           MOVE 'INPUT-FILE' TO UT-MOCK-FIND-FILENAME
           MOVE 'OPEN' TO UT-MOCK-FIND-OPERATION
           MOVE  ZERO  TO UT-MOCK-ACCESS-COUNT(UT-MOCK-IX)
           MOVE 87 TO UT-MOCK-SET-FILE-STATUS
           SET UT-FIND-FILE-MOCK TO TRUE
           PERFORM UT-SET-MOCK
           PERFORM 0100-OPEN-INPUT
           ADD 1 TO UT-TEST-CASE-COUNT
           SET UT-NORMAL-COMPARE TO TRUE
           MOVE WS-INPUT-FILE-STATUS TO UT-ACTUAL
           MOVE '87'
                       TO UT-EXPECTED
           SET UT-COMPARE-DEFAULT TO TRUE
           PERFORM UT-ASSERT-EQUAL

           PERFORM UT-AFTER
           MOVE 'IT VERIFIES INPUT-FILE WAS NOT READ'
               TO UT-TEST-CASE-NAME
           PERFORM UT-BEFORE
           SET UT-FIND-FILE-MOCK TO TRUE
           MOVE 'INPUT-FILE' TO UT-MOCK-FIND-FILENAME
           MOVE 'OPEN' TO UT-MOCK-FIND-OPERATION
           MOVE  ZERO  TO UT-MOCK-ACCESS-COUNT(UT-MOCK-IX)
           MOVE 87 TO UT-MOCK-SET-FILE-STATUS
           SET UT-FIND-FILE-MOCK TO TRUE
           PERFORM UT-SET-MOCK
           PERFORM 0100-OPEN-INPUT
           SET UT-FIND-FILE-MOCK TO TRUE
           MOVE 'INPUT-FILE' TO UT-MOCK-FIND-FILENAME
           MOVE 'READ' TO UT-MOCK-FIND-OPERATION
           PERFORM UT-LOOKUP-MOCK
           IF UT-MOCK-FOUND
           PERFORM UT-LOOKUP-FILE
           MOVE 0000
            TO UT-EXPECTED-ACCESSES
           MOVE UT-MOCK-ACCESS-COUNT(UT-MOCK-IX)
            TO UT-ACTUAL-ACCESSES
           ADD 1 TO UT-TEST-CASE-COUNT
           SET UT-VERIFY-EXACT TO TRUE
           PERFORM UT-ASSERT-ACCESSES
           PERFORM UT-AFTER
            COPY ZUTZCPD     .
           .
       UT-BEFORE.

           .
       UT-AFTER.

           .
       UT-INITIALIZE.
           MOVE SPACES TO UT-FILE-INFORMATION

           .
       UT-END.


           .
       0100-OPEN-INPUT.
      *    OPEN INPUT INPUT-FILE
           MOVE 'INPUT-FILE' TO UT-MOCK-FIND-FILENAME
           PERFORM UT-LOOKUP-MOCK
           IF UT-MOCK-FOUND
           ADD 1 TO UT-MOCK-ACCESS-COUNT(UT-MOCK-IX)
           MOVE 'INPUT-FILE' TO UT-MOCK-FIND-FILENAME
           PERFORM UT-LOOKUP-FILE
            IF UT-MOCK-RECORD(UT-MOCK-IX)
                NOT EQUAL SPACES
            MOVE UT-MOCK-RECORD(UT-MOCK-IX)
                TO INPUT-RECORD
           END-IF
            IF UT-MOCK-FILE-STATUS(UT-MOCK-IX)
                NOT EQUAL SPACES
            MOVE UT-MOCK-FILE-STATUS(UT-MOCK-IX)
                TO WS-INPUT-FILE-STATUS
           END-IF
      *    OPEN INPUT INPUT-FILE


           .
       0200-READ-INPUT-FILE.
      *    READ INPUT-FILE
           MOVE 'INPUT-FILE' TO UT-MOCK-FIND-FILENAME
           PERFORM UT-LOOKUP-MOCK
           IF UT-MOCK-FOUND
           ADD 1 TO UT-MOCK-ACCESS-COUNT(UT-MOCK-IX)
           MOVE 'INPUT-FILE' TO UT-MOCK-FIND-FILENAME
           PERFORM UT-LOOKUP-FILE
            IF UT-MOCK-RECORD(UT-MOCK-IX)
                NOT EQUAL SPACES
            MOVE UT-MOCK-RECORD(UT-MOCK-IX)
                TO INPUT-RECORD
           END-IF
            IF UT-MOCK-FILE-STATUS(UT-MOCK-IX)
                NOT EQUAL SPACES
            MOVE UT-MOCK-FILE-STATUS(UT-MOCK-IX)
                TO WS-INPUT-FILE-STATUS
           END-IF
      *    READ INPUT-FILE


           .
       9999-END.

           .
