           TestSuite "Mocking tests"

           MOCK SECTION 000-START
           PERFORM 100-WELCOME
           PERFORM 500-SWITCH
           END-MOCK

           MOCK PARAGRAPH 300-CHANGE-1
              EVALUATE VALUE-1
              WHEN "Hello"
                MOVE "MOCKED" TO VALUE-1
              WHEN OTHER
                MOVE "mocked" TO VALUE-1
              END-EVALUATE
           END-MOCK

           TestCase "Global mock behaves as intended"
           PERFORM 000-START
           Expect VALUE-1 to be "Hi"
           Expect VALUE-2 to be "Hello"
           VERIFY SECTION 000-START HAPPENED ONCE

           TestCase "Local mock overwrites global mock"
           MOCK SECTION 000-START
                MOVE "This is" TO VALUE-1
                MOVE "a mock" TO VALUE-2
           END-MOCK
           PERFORM 000-START
           PERFORM 000-START
           Expect VALUE-1 to be "This is"
           Expect VALUE-2 to be "a mock"
           VERIFY SECTION 000-START HAPPENED AT LEAST 2 TIMES

           TestCase "Multiple local mocks behaves as intended"
           MOCK SECTION 000-START
                MOVE "This is" TO VALUE-1
                MOVE "a mock" TO VALUE-2
                PERFORM 100-WELCOME
                PERFORM 100-WELCOME
                PERFORM 100-WELCOME
           END-MOCK
           MOCK SECTION 100-WELCOME
                MOVE "I'll leave VALUE-2 alone" TO VALUE-1
           END-MOCK
           MOCK PARAGRAPH 500-SWITCH
           END-MOCK
           PERFORM 000-START
           PERFORM 000-START
           Expect VALUE-1 to be "I'll leave VALUE-2 alone"
           Expect VALUE-2 to be "a mock"
           VERIFY SECTION 000-START HAPPENED 5 TIMES
           VERIFY SECTION 100-WELCOME HAPPENED NO MORE THAN 10 TIMES
           VERIFY PARAGRAPH 500-SWITCH NEVER HAPPENED

           TestCase "Empty local mock makes section do nothing"
           MOCK PARAGRAPH 500-SWITCH
           END-MOCK
           PERFORM 100-WELCOME
           PERFORM 500-SWITCH
           Expect VALUE-1 to be "Hello"
           Expect VALUE-2 to be "Hi"
           VERIFY PARAGRAPH 500-SWITCH HAPPENED ONCE

           TestCase "Local and global mocks can be used together"
           MOCK SECTION 100-WELCOME
                MOVE "Mockity-" TO VALUE-1
                MOVE "Mock" TO VALUE-2
           END-MOCK
           PERFORM 000-START
           Expect VALUE-1 to be "Mock"
           Expect VALUE-2 to be "Mockity-"

           TestCase "If no local or global mock run source code"
           PERFORM 100-WELCOME
           Expect VALUE-1 to be "Hello"
           Expect VALUE-2 to be "Hi"

           TestCase "Global paragraph mock works"
           PERFORM 100-WELCOME
           PERFORM 300-CHANGE-1
           Expect VALUE-1 to be "MOCKED"
           Expect VALUE-2 to be "Hi"
