//SAMPLEJC  JOB NOTIFY=&SYSUID,
// REGION=0M,MSGLEVEL=1,MSGCLASS=H
//* Remove previous COBOL-Check output
//USSRMAT EXEC PGM=BPXBATCH,
//             PARM='SH rm /u/cecuser/cobol-check/ALLTESTS'
//USSRMCOB EXEC PGM=BPXBATCH,
//             PARM='SH rm /u/cecuser/SAMPLET.CBL'
//* Copy COBOL Source and Testsuite DATASETS to USS
//COPYCBL EXEC PGM=IKJEFT01
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD *
OPUT CCTEST(SAMPLECB) -
'/u/cecuser/cobol-check/src/main/cobol/SAMPLE/SAMPLE.CBL' -
TEXT
/*
//COPYTEST EXEC PGM=IKJEFT01
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD *
OPUT CCTEST(SAMPLETS) -
'/u/cecuser/cobol-check/src/test/cobol/SAMPLE/SAMPLE-TESTSTSUITE' -
TEXT
/*
//* Run COBOL-Check
//USSCOBCK EXEC PGM=BPXBATCH
//STDOUT DD SYSOUT=*
//STDERR DD SYSOUT=*
//STDPARM DD *
SH java -jar /u/cecuser/cobol-check/bin/cobol-check-0.0.0.jar
-c /u/cecuser/cobol-check/config.properties
-p SAMPLE
/*
//* Compile, Link and Run final program
//CL EXEC PROC=IGYWCL
//STEPLIB  DD DSN=IGY.V6R3M0.SIGYCOMP,DISP=SHR
//SYSUT8   DD  UNIT=SYSALLDA,SPACE=(CYL,(1,1))
//SYSUT9   DD  UNIT=SYSALLDA,SPACE=(CYL,(1,1))
//SYSUT10  DD  UNIT=SYSALLDA,SPACE=(CYL,(1,1))
//SYSUT11  DD  UNIT=SYSALLDA,SPACE=(CYL,(1,1))
//SYSUT12  DD  UNIT=SYSALLDA,SPACE=(CYL,(1,1))
//SYSUT13  DD  UNIT=SYSALLDA,SPACE=(CYL,(1,1))
//SYSUT14  DD  UNIT=SYSALLDA,SPACE=(CYL,(1,1))
//SYSUT15  DD  UNIT=SYSALLDA,SPACE=(CYL,(1,1))
//SYSMDECK DD  UNIT=SYSALLDA,SPACE=(CYL,(1,1))
//COBOL.SYSIN DD PATH='/u/cecuser/SAMPLET.CBL',
//        LRECL=80,BLKSIZE=240,RECFM=FB,FILEDATA=TEXT
//LKED.SYSLMOD DD DSN=&SYSUID..LOAD(SAMPLET),DISP=SHR
//CBLCHK EXEC PGM=SAMPLET
//STEPLIB   DD DSN=&SYSUID..LOAD,DISP=SHR
//SYSOUT   DD SYSOUT=*
//*
//*
