      * Start of COPY005.CBL                                                    
       01  COPY-005-GROUP-ITEM.                                                 
      * Start of COPY006                                                        
           03  COPY006-GROUP-1.                                                 
               05  COPY006-ITEM-1 PIC X.                                        
      * Start of COPY003                                                        
           05  COPY003-ITEM-1 PIC X.                                            
           05  COPY003-ITEM-2 PIC X.                                            
      * End of COPY003                                                          
      *        COPY COPY003.                                                    
               05  COPY006-ITEM-2 PIC X.                                        
           03  COPY006-GROUP-2.                                                 
      * Start of COPY004                                                        
           05  COPY004-ITEM-1 PIC X.                                            
           05  COPY004-ITEM-2 PIC X.                                            
      * End of COPY004                                                          
      *        COPY COPY004.                                                    
      * End of COPY006                                                          
      *    COPY COPY006.                                                        
      * End of COPY005.CBL                                                      
