      * Start of COPY002                                                        
       01  TEST-GROUP-002.                                                      
      * Start of COPY003                                                        
           05  COPY003-ITEM-1 PIC X.                                            
           05  COPY003-ITEM-2 PIC X.                                            
      * End of COPY003                                                          
      *    COPY COPY003.                                                        
      * Start of COPY004                                                        
           05  COPY004-ITEM-1 PIC X.                                            
           05  COPY004-ITEM-2 PIC X.                                            
      * End of COPY004                                                          
      *    COPY COPY004.                                                        
           05 TEST-SOME-OTHER-STUFF PIC X.                                      
      * End of COPY002                                                          
