      * Start of mixed006
           03  Mixed006-Group-1.
               05  Mixed006-Item-1 pic X.
               copy mixed003.
               05  Mixed006-Item-2 PIC X.
           03  mixed006-Group-2.
               copy mixed004.
      * End of mixed006