           TestSuite "Verify Cobol Check handles numeric relations properly"

           TestCase "Equal sign with literal compare"
           Move 25.74 to WS-FIELD-1
           Expect WS-FIELD-1 = 25.74

           TestCase "Equal sign with literal compare (should fail)"
           Move 25.74 to WS-FIELD-1
           Expect WS-FIELD-1 = 25.75

           TestCase "Not-equal sign with literal compare"
           Move 13.6 to WS-FIELD-1
           Expect WS-FIELD-1 != 25.74

           TestCase "Not-equal sign with literal compare (should fail)"
           Move 13.6 to WS-FIELD-1
           Expect WS-FIELD-1 != 13.6

           TestCase "Equal sign with field to field compare"
           Move 25.74 to WS-FIELD-1
           Move 25.74 to WS-FIELD-2
           Expect WS-FIELD-1 = WS-FIELD-2

           TestCase "Equal sign with field to field compare (should fail)"
           Move 25.74 to WS-FIELD-1
           Move 25.75 to WS-FIELD-2
           Expect WS-FIELD-1 = WS-FIELD-2

           TestCase "Not-equal sign with field to field compare"
           Move 25.74 to WS-FIELD-1
           Move 25.75 to WS-FIELD-2
           Expect WS-FIELD-1 != WS-FIELD-2

           TestCase "Not-equal sign with field to field compare (should fail)"
           Move 25.74 to WS-FIELD-1
           Move 25.74 to WS-FIELD-2
           Expect WS-FIELD-1 != WS-FIELD-2

           TestCase "Less-than sign with literal compare"
           Move 18.067 to WS-FIELD-1
           Expect WS-FIELD-1 < 18.068

           TestCase "Less-than sign with literal compare (should fail)"
           Move 18.067 to WS-FIELD-1
           Expect WS-FIELD-1 < 18.066

           TestCase "Less-than sign with field to field compare"
           Move 416.071 to WS-FIELD-1
           Move 416.072 to WS-FIELD-2
           Expect WS-FIELD-1 < WS-FIELD-2

           TestCase "Less-than sign with field to field compare (should fail)"
           Move 416.072 to WS-FIELD-1
           Move 416.072 to WS-FIELD-2
           Expect WS-FIELD-1 < WS-FIELD-2

           TestCase "Greater-than sign with literal compare"
           Move 18.067 to WS-FIELD-1
           Expect WS-FIELD-1 > 17.01

           TestCase "Greater-than sign with literal compare (should fail)"
           Move 9.805 to WS-FIELD-1
           Expect WS-FIELD-1 > 10

           TestCase "Greater-than sign with field to field compare"
           Move 1766.03145 to WS-FIELD-1
           Move 1766.03144 to WS-FIELD-2
           Expect WS-FIELD-1 > WS-FIELD-2

           TestCase "Greater-than sign with field to field compare (should fail)"
           Move 1766.03143 to WS-FIELD-1
           Move 1766.03144 to WS-FIELD-2
           Expect WS-FIELD-1 > WS-FIELD-2






