           TestSuite "Verify Cobol Check handles numeric relations properly"

           TestCase "Equal sign with literal compare"
           Move 25.74 to WS-FIELD-1
           Expect WS-FIELD-1 = 25.74

           TestCase "Equal sign with literal compare (should fail)"
           Move 25.74 to WS-FIELD-1
           Expect WS-FIELD-1 = 25.75

           TestCase "Not equal sign with literal compare"
           Move 25.74 to WS-FIELD-1
           Expect WS-FIELD-1 NOT = 25.75

           TestCase "Not equal sign with literal compare (should fail)"
           Move 25.74 to WS-FIELD-1
           Expect WS-FIELD-1 not = 25.74

           TestCase "Not-equal sign with literal compare"
           Move 13.6 to WS-FIELD-1
           Expect WS-FIELD-1 != 25.74

           TestCase "Not-equal sign with literal compare (should fail)"
           Move 13.6 to WS-FIELD-1
           Expect WS-FIELD-1 != 13.6

           TestCase "Not not-equal sign with literal compare"
           Move 13.6 to WS-FIELD-1
           Expect WS-FIELD-1 NOT != 13.6

           TestCase "Not not-equal sign with literal compare (should fail)"
           Move 13.7 to WS-FIELD-1
           Expect WS-FIELD-1 not != 13.6

           TestCase "Equal sign with ield compare"
           Move 25.74 to WS-FIELD-1
           Move 25.74 to WS-FIELD-2
           Expect WS-FIELD-1 = WS-FIELD-2

           TestCase "Equal sign with field compare (should fail)"
           Move 25.74 to WS-FIELD-1
           Move 25.75 to WS-FIELD-2
           Expect WS-FIELD-1 = WS-FIELD-2

           TestCase "Not equal sign with field compare"
           Move 25.74 to WS-FIELD-1
           Move 25.75 to WS-FIELD-2
           Expect WS-FIELD-1 not = WS-FIELD-2

           TestCase "Not equal sign with field compare (should fail)"
           Move 25.74 to WS-FIELD-1
           Move 25.74 to WS-FIELD-2
           Expect WS-FIELD-1 not = WS-FIELD-2

           TestCase "Not-equal sign with field compare"
           Move 25.74 to WS-FIELD-1
           Move 25.75 to WS-FIELD-2
           Expect WS-FIELD-1 != WS-FIELD-2

           TestCase "Not-equal sign with field compare (should fail)"
           Move 25.74 to WS-FIELD-1
           Move 25.74 to WS-FIELD-2
           Expect WS-FIELD-1 != WS-FIELD-2

           TestCase "Not not-equal sign with field compare"
           Move 25.74 to WS-FIELD-1
           Move 25.74 to WS-FIELD-2
           Expect WS-FIELD-1 NOT != WS-FIELD-2

           TestCase "Not not-equal sign with field compare (should fail)"
           Move 25.75 to WS-FIELD-1
           Move 25.74 to WS-FIELD-2
           Expect WS-FIELD-1 not != WS-FIELD-2

           TestCase "Less-than sign with literal compare"
           Move 18.067 to WS-FIELD-1
           Expect WS-FIELD-1 < 18.068

           TestCase "Less-than sign with literal compare (should fail)"
           Move 18.067 to WS-FIELD-1
           Expect WS-FIELD-1 < 18.066

           TestCase "Not less-than sign with literal compare"
           Move 18.068 to WS-FIELD-1
           Expect WS-FIELD-1 NOT < 18.068

           TestCase "Not less-than sign with literal compare (should fail)"
           Move 18.066 to WS-FIELD-1
           Expect WS-FIELD-1 Not < 18.067

           TestCase "Less-than sign with field compare"
           Move 416.071 to WS-FIELD-1
           Move 416.072 to WS-FIELD-2
           Expect WS-FIELD-1 < WS-FIELD-2

           TestCase "Less-than sign with field compare (should fail)"
           Move 416.072 to WS-FIELD-1
           Move 416.072 to WS-FIELD-2
           Expect WS-FIELD-1  < WS-FIELD-2

           TestCase "Not less-than sign with field compare"
           Move 416.072 to WS-FIELD-1
           Move 416.071 to WS-FIELD-2
           Expect WS-FIELD-1 not < WS-FIELD-2

           TestCase "Not less-than sign with field compare (should fail)"
           Move 416.071 to WS-FIELD-1
           Move 416.072 to WS-FIELD-2
           Expect WS-FIELD-1 not < WS-FIELD-2

           TestCase "Greater-than sign with literal compare"
           Move 18.067 to WS-FIELD-1
           Expect WS-FIELD-1 > 17.01

           TestCase "Greater-than sign with literal compare (should fail)"
           Move 9.805 to WS-FIELD-1
           Expect WS-FIELD-1 > 10

           TestCase "Not greater-than sign with literal compare"
           move 107.701 to ws-field-1
           move 107.701 to ws-field-2
           expect ws-field-1 not > ws-field-2

           TestCase "Not greater-than sign with literal compare (should fail)"
           move 107.702 to ws-field-1
           move 107.701 to ws-field-2
           expect ws-field-1 not > ws-field-2

           TestCase "Greater-than sign with field compare"
           Move 1766.03145 to WS-FIELD-1
           Move 1766.03144 to WS-FIELD-2
           Expect WS-FIELD-1 > WS-FIELD-2

           TestCase "Greater-than sign with field compare (should fail)"
           Move 1766.03143 to WS-FIELD-1
           Move 1766.03144 to WS-FIELD-2
           Expect WS-FIELD-1 > WS-FIELD-2

           TestCase "Not greater-than sign with field to field compare"
           Move 1766.03144 to WS-FIELD-1
           Move 1766.03144 to WS-FIELD-2
           Expect WS-FIELD-1 Not > WS-FIELD-2

           TestCase "Not greater-than sign with field compare (should fail)"
           Move 1766.03145 to WS-FIELD-1
           Move 1766.03144 to WS-FIELD-2
           Expect WS-FIELD-1 NOT > WS-FIELD-2

           TestCase "Greater-than-or-equal-to sign with literal compare when greater"
           Move 18.067 to WS-FIELD-1
           Expect WS-FIELD-1 >= 18.066

           TestCase "Greater-than-or-equal-to sign with literal compare when equal"
           Move 18.067 to WS-FIELD-1
           Expect WS-FIELD-1 >= 18.067

           TestCase "Greater-than-or-equal-to sign with literal compare (should fail)"
           Move 9.805 to WS-FIELD-1
           Expect WS-FIELD-1 >= 10

           TestCase "Not greater-than-or-equal-to sign with literal compare when less"
           Move 18.066 to WS-FIELD-1
           Expect WS-FIELD-1 not >= 18.067

           TestCase "Not greater-than-or-equal-to sign with literal compare when equal (should fail)"
           Move 18.067 to WS-FIELD-1
           Expect WS-FIELD-1 not >= 18.067

           TestCase "Greater-than-or-equal-to sign with literal compare when greater (should fail)"
           Move 13.45 to WS-FIELD-1
           Expect WS-FIELD-1 not >= 13.44

           TestCase "Greater-than-or-equal-to-sign with field compare when equal"
           move 475.062 to ws-field-1
           move 475.062 to ws-field-2
           expect ws-field-1 >= ws-field-2

           TestCase "Greater-than-or-equal-to-sign with field compare when greater"
           move 475.063 to ws-field-1
           move 475.062 to ws-field-2
           expect ws-field-1 >= ws-field-2

           TestCase "Greater-than-or-equal-to-sign with field compare when less (should fail)"
           move 475.061 to ws-field-1
           move 475.062 to ws-field-2
           expect ws-field-1 >= ws-field-2

           TestCase "Not greater-than-or-equal-to-sign with field compare when less"
           move 475.062 to ws-field-1
           move 475.063 to ws-field-2
           expect ws-field-1 not >= ws-field-2

           TestCase "Not greater-than-or-equal-to-sign with field compare when equal (should fail)"
           move 475.062 to ws-field-1
           move 475.062 to ws-field-2
           expect ws-field-1 not >= ws-field-2

           TestCase "Not greater-than-or-equal-to-sign with field compare when greater (should fail)"
           move 475.063 to ws-field-1
           move 475.062 to ws-field-2
           expect ws-field-1 not >= ws-field-2

           TestCase "Less-than-or-equal-to-sign with field compare when equal"
           move 475.062 to ws-field-1
           move 475.062 to ws-field-2
           expect ws-field-1 <= ws-field-2

           TestCase "Less-than-or-equal-to-sign with field compare when less"
           move 475.062 to ws-field-1
           move 475.063 to ws-field-2
           expect ws-field-1 <= ws-field-2

           TestCase "Less-than-or-equal-to-sign with field compare when greater (should fail)"
           move 475.063 to ws-field-1
           move 475.062 to ws-field-2
           expect ws-field-1 <= ws-field-2

           TestCase "Not less-than-or-equal-to-sign with field compare when greater"
           move 475.063 to ws-field-1
           move 475.062 to ws-field-2
           expect ws-field-1 not <= ws-field-2

           TestCase "Not greater-than-or-equal-to-sign with field compare when equal (should fail)"
           move 475.062 to ws-field-1
           move 475.062 to ws-field-2
           expect ws-field-1 not <= ws-field-2

           TestCase "Not greater-than-or-equal-to-sign with field compare when less (should fail)"
           move 475.062 to ws-field-1
           move 475.063 to ws-field-2
           expect ws-field-1 not <= ws-field-2







