000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.  GREETING.
000300*****************************************************************
000400* Trivial program to exercise CobolCheck.
000500*****************************************************************       
000600 ENVIRONMENT DIVISION.
000700 INPUT-OUTPUT SECTION.
000800 FILE-CONTROL.
000900 DATA DIVISION.
001000 WORKING-STORAGE SECTION.
001100 01  FILLER.
001200     05  WS-COUNT           PIC S9(5) COMP-3.
001300     05  FILLER             PIC X VALUE 'G'.
001400         88  MESSAGE-IS-GREETING  VALUE 'G'.
001500         88  MESSAGE-IS-FAREWELL  VALUE 'F'.
001600         88  MESSAGE-IS-FAREWELL-LONG  VALUE 'L'.
001700 01  WS-FRIEND           PIC X(10) VALUE SPACES.
001800 01  WS-GREETING.
001900         10  FILLER          PIC X(07) VALUE 'Hello, '.
002000         10  WS-USER-NAME    PIC X(05) VALUE SPACES.
002100         10  FILLER          PIC X     VALUE '!'.
002200 01  WS-FAREWELL.
002300         10  FILLER          PIC X(15) VALUE 'See you later, '.
002400         10  WS-USER-NAME    PIC X(09) VALUE SPACES.
002500         10  FILLER          PIC X     VALUE '!'.
002600 01  WS-FAREWELL-LONG.
002700         10  FILLER          PIC X(15) VALUE 'See you later, '.
002800         10  WS-USER-NAME-LONG PIC X(19) VALUE SPACES.
002900         10  FILLER          PIC X     VALUE '!'.               
003000     REPLACE
003100         ==:TEXT:==  BY =="ReallylongAlligator"==.
003200
003300 PROCEDURE DIVISION.
003400
003500     ACCEPT WS-FRIEND.
003600
003700 2000-SPEAK.
003800     IF MESSAGE-IS-GREETING
003900         IF WS-FRIEND EQUAL SPACES
004000             MOVE 'World' TO WS-USER-NAME OF WS-GREETING
004100         ELSE
004200             MOVE WS-FRIEND TO WS-USER-NAME OF WS-GREETING
004300         END-IF
004400     END-IF  
004500     IF MESSAGE-IS-FAREWELL
004600         IF WS-FRIEND EQUAL SPACES
004700             MOVE 'alligator!' TO WS-USER-NAME OF WS-FAREWELL
004800         ELSE
004900             MOVE WS-FRIEND TO WS-USER-NAME OF WS-FAREWELL
005000         END-IF
005100     END-IF    
005200     IF MESSAGE-IS-FAREWELL-LONG 
005300         IF WS-FRIEND EQUAL SPACES
005400             MOVE :TEXT: TO WS-USER-NAME-LONG OF WS-FAREWELL-LONG
005500         ELSE
005600             MOVE WS-FRIEND TO WS-USER-NAME-LONG 
005700               OF WS-FAREWELL-LONG
005800         END-IF
005900     END-IF    
006000     .    
006100
006200 9999-END.
006300     CONTINUE
006400     .
006500